<!DOCTYPE html>
<html lang="fr">

<head>
    <!-- Required meta tags -->
    <meta charset="utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="HandheldFriendly" content="True" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="robots" content="" />

    <!-- Favicon -->
    <link rel="icon" href="https://nightlyside.github.io/blog/theme/favicon.ico" />
    <link rel="icon" type="image/png" href="https://nightlyside.github.io/blog/theme/favicon.png" />

    <!-- Browser Color -->
     <meta name="author" content="Alexandre Froehlich" />
    <meta name="description" content="Site web portfolio de Alexandre Froehlich" />

    <title>La Bataille Brestoise | Alexandre Froehlich
 | Alexandre Froehlich</title>

    <!-- CSS -->
    <link rel="stylesheet" type="text/css" href="https://nightlyside.github.io/blog/theme/css/bootstrap.css" />
    <link rel="stylesheet" type="text/css" href="https://nightlyside.github.io/blog/theme/css/fontawesome.css" />
    <link rel="stylesheet" type="text/css" href="https://nightlyside.github.io/blog/theme/css/pygments/default.css">
    <link rel="stylesheet" type="text/css" href="https://nightlyside.github.io/blog/theme/css/blog.css" />

    <!-- Javascript -->
    <script src="https://nightlyside.github.io/blog/theme/js/jquery.js"></script>
    <script src="https://nightlyside.github.io/blog/theme/js/bootstrap.js"></script>
    <script src="https://nightlyside.github.io/blog/theme/js/fontawesome.js"></script>
    <script src="https://nightlyside.github.io/blog/theme/js/zooming.min.js"></script>
    
    <script>
        MathJax = {
            tex: {
                inlineMath: [['$', '$'], ['\\(', '\\)']],
                displayMath: [['$$', '$$'], ['\\[', '\\]']]
            },
            svg: {
                fontCache: 'global'
            }
        };
    </script>
    <script src="https://polyfill.io/v3/polyfill.min.js?features=es6"></script>
    <script id="MathJax-script" async src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
</head>

<body>
    <!--
  _   _ _       _     _   _           _     _      
 | \ | (_) __ _| |__ | |_| |_   _ ___(_) __| | ___ 
 |  \| | |/ _` | '_ \| __| | | | / __| |/ _` |/ _ \
 | |\  | | (_| | | | | |_| | |_| \__ \ | (_| |  __/
 |_| \_|_|\__, |_| |_|\__|_|\__, |___/_|\__,_|\___|
          |___/             |___/                  
-->
    <div class="container-fluid">
        <div class="row">
            <!-- Fixed nav section -->
            <div class="about col-sm-12 col-md-3 col-lg-2">
                <nav class="navbar navbar-fixed-side sticky-top row">
                    <img src="https://nightlyside.github.io/blog/images/avatar.png" alt="Alexandre Froehlich" />
                    <h2 class="col-sm-12"><a href="https://nightlyside.github.io/blog">Alexandre Froehlich</a></h2>
                    <p class="col-sm-12">
                        Hobbyist programmer. Petit développeur indépendant (aka.
                        Nightlyside) dont le rêve est d’être capable de publier un projet
                        terminé. Actuellement étudiant à l'ENSTA Bretagne
                    </p>

                    <!-- Navigation -->
                    <ul class="nav-list">
                        <li class="nav-item">
                            <span class="nav-item-separator">//</span><a href="https://nightlyside.github.io/blog">Accueil</a>
                        </li>
                        <li class="nav-item">
                            <span class="nav-item-separator">//</span><a href="https://nightlyside.github.io/blog/files/cv.pdf">CV</a>
                        </li>
                        <li class="nav-item">
                            <span class="nav-item-separator">//</span><a href="https://nightlyside.github.io/blog/categories">Catégories</a>
                        </li>
                        <li class="nav-item">
                            <span class="nav-item-separator">//</span><a href="https://nightlyside.github.io/blog/archives">Archives</a>
                        </li>
                        <li class="nav-item">
                            <span class="nav-item-separator">//</span><a href="https://nightlyside.github.io/blog">À propos</a>
                        </li>
                    </ul>

                    <!-- Social links -->
                    <ul class="social">
                        <a href="https://github.com/nightlyside">
                            <li><i class="fab fa-github-square"></i></li>
                        </a>
                        <a href="https://www.linkedin.com/in/alexandre-f-1102298a">
                            <li><i class="fab fa-linkedin"></i></li>
                        </a>
                        <a href="https://twitter.com/froalexandre">
                            <li><i class="fab fa-twitter-square"></i></li>
                        </a>
                        <a href="https://reddit.com/u/nightlyside">
                            <li><i class="fab fa-reddit-square"></i></li>
                        </a>
                    </ul>
                </nav>
            </div>
            <!-- Main content -->
            <div class="col-sm-12 col-md-9 col-lg-10 main">
    <img class="featured_image" src="https://nightlyside.github.io/blog//images/projets/bataille-brestoise/logo.png" alt="Image de l'article">
                 <div class="container content">
                    <!-- Insert content here -->
<h1 class="title">La Bataille Brestoise</h1>
<p class="sous-titre">
    <span class="date-poste">Posté le lun. 15 juin 2020 dans <a href="category/projets.html">projets</a></span> <br>
    <span class="temps-lecture">Temps de lecture : 3 minutes</span>
</p>
<hr>

<p>Dans le cadre de mes &eacute;tudes d'ing&eacute;nieur &agrave; l'<a href="https://www.ensta-bretagne.fr">ENSTA Bretagne</a>, j'ai r&eacute;alis&eacute; &agrave; l'aide de mon bin&ocirc;me un projet de fin de cycle en python avec pour objectif d'y int&eacute;grer de la programmation orient&eacute;e objet ainsi que de l'interface homme machine.<br/>
"La bataille brestoise" est le projet que nous avons cod&eacute; sur pr&egrave;s de 3 mois. Il s'agit d'un jeu en r&eacute;seau de bataille navale en temps r&eacute;el bas&eacute; sur la rade de Brest ainsi que sur les b&acirc;timents de la Marine Nationale.
</p>
<hr/>
<blockquote>
<p>Le projet est disponible sur mon repo (installation et utilisation) : <a href="https://github.com/NightlySide/La-Bataille-Brestoise">https://github.com/NightlySide/La-Bataille-Brestoise</a></p>
</blockquote>
<h2 id="introduction">Introduction</h2>
<p>L'objectif initial du projet &eacute;tait de mettre &agrave; profit le cours vu sur la programmation orient&eacute;e objet ainsi que les bases de l'Interface Homme-Machine (IHM). Cependant, avec mon bin&ocirc;me nous avons souhait&eacute; pousser le projet plus loin en y int&eacute;grant par exemple une connexion clients-serveur et des machines &agrave; &eacute;tat finis pour faire de l'intelligence artificielle.</p>
<p>Nous avons donc d&eacute;cid&eacute; de partir sur le d&eacute;veloppement d'un jeu de bataille navale en temps r&eacute;el, inspir&eacute; de jeux en .io tel que le c&eacute;l&egrave;bre <a href="https://agar.io">agar.io</a>, dont les b&acirc;timents sont inspir&eacute;s de la Marine Nationale.<br/>
Dans ce jeu, le but sera d'atteindre le niveau 5 en &eacute;liminant les adversaires (IA et joueurs r&eacute;els) pour obtenir des points d'exp&eacute;rience. Si le joueur d&eacute;c&egrave;de, il r&eacute;appara&icirc;t avec un b&acirc;timent de niveau inf&eacute;rieur.<br/>
Des commandes sont disponibles pour le client et pour le serveur de mani&egrave;re &agrave; pouvoir int&eacute;ragir avec le jeu. De plus une chatbox est mise &agrave; disposition des joueurs pour la communication entre les joueurs et la communication des informations sur la partie.</p>
<p>L'&eacute;quilibrage du jeu est obtenu par deux &eacute;tapes, la premi&egrave;re &eacute;tant un calcul b&egrave;te et m&eacute;chant de d&eacute;g&acirc;ts par seconde. Les r&eacute;sultats condens&eacute;s dans un tableau excel permettent de mettre en avant cet &eacute;quilibrage. La deuxi&egrave;me &eacute;tape consiste &agrave; tester les r&eacute;glages en jeu.</p>
<p><img alt="Equilibrage des b&acirc;timents" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/balance.png"/></p>
<p>Pour ce jeu, on a tout d'abord commenc&eacute; par la cr&eacute;ation du serveur. </p>
<h2 id="le serveur">Le serveur</h2>
<p>Nous souhaitions impl&eacute;mente une structure de serveur autoritaire et de clients simples (<a href="https://www.gabrielgambetta.com/client-server-game-architecture.html">Explication</a>). Tout en ayant une interface simple et d&eacute;ployable sur un serveur externe en headless.</p>
<p><img alt="&Eacute;cran de d&eacute;marrage serveur" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/console_serveur.png"/></p>
<p>Pour se faire, en utilisant python le choix &eacute;vident &eacute;tait de se tourner vers la biblioth&egrave;que <code>sockets</code> pour cr&eacute;er un tunnel TCP entre le client et le serveur.<br/>
Cependant son utilisation entra&icirc;ne un probl&egrave;me. Le tunnel ainsi cr&eacute;e ne fonctionne qu'entre le serveur et un seul client. Or nous souhaitons pouvoir jouer en multijoueurs. Deux solutions sont disponibles : 
- Utiliser <code>sockets</code> avec <code>selectors</code> pour faire du multiplexage des entr&eacute;es et ainsi avoir plusieurs clients connect&eacute;s en m&ecirc;me temps
- Utiliser la nouvelle biblioth&egrave;que <code>asyncio</code> apport&eacute;e par python 3</p>
<p>Nous avons d&eacute;cid&eacute; de partir sur la deuxi&egrave;me solution, cette derni&egrave;re prenant en charge le c&ocirc;t&eacute; asynchrone du serveur par le biais de deux nouveaux mots cl&eacute;s : <em>async</em> et <em>await</em>.</p>
<p>A partir de la on peut commencer &agrave; cr&eacute;er un serveur prenant en charge la connexion de multiples clients et en leur associant un identifiant unique.</p>
<h3 id="les entites">Les entit&eacute;s</h3>
<p>Le serveur &eacute;tant autoritaire c'est &agrave; lui de g&eacute;rer les entit&eacute;s, par cons&eacute;quent de g&eacute;rer l'intelligence artificielle de ces derni&egrave;res. Encore une fois plusieurs m&eacute;thodes sont disponibles, mais celle qui m'a le plus attir&eacute; est la machine &agrave; &eacute;tats-finis.<br/>
Pour les non initi&eacute;s, la machine &agrave; &eacute;tats finis est un automate qui est dirig&eacute; par l'&eacute;tat dans lequel il se trouve actuellement. Ci-dessous, je vous pr&eacute;sente le diagramme des &eacute;tats r&eacute;gissant l'intelligence artificielle des entit&eacute;s.</p>
<p><img alt="Diagramme des &eacute;tats des entit&eacute;s" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/FSM.png"/></p>
<h2 id="le client_1">Le client</h2>
<p>Pour la cr&eacute;ation du client plusieurs biblioth&egrave;ques graphiques sont &agrave; notre disposition. Je pourrais citer par exemple tkinter, wxPython, pyQt ou m&ecirc;me Kivy. Nous avons d&eacute;cider de d&eacute;velopper notre interface avec <a href="https://fr.wikipedia.org/wiki/PyQt">PyQt5</a> en raison de son outil <em>QtDesigner</em> (un outil graphique pour g&eacute;n&eacute;rer des interfaces) et sa documentation tr&egrave;s fournie. </p>
<p>Le premier &eacute;cran est celui de connexion au serveur. Les serveurs enregistr&eacute;s sont affich&eacute;s dans une liste et l'utilisateur peut choisir son pseudonyme.</p>
<p><img alt="&Eacute;cran de connexion client" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/start_screen.gif"/></p>
<p>Une fois connect&eacute;, un identifiant unique lui est attribu&eacute; par le serveur afin de pouvoir se faire authentifier par le serveur ainsi que les autres clients. Cette &eacute;tape r&eacute;alis&eacute;e, l'interface de jeu peut s'ouvrir, pr&eacute;sentant l'aire de jeu, la carte (bas&eacute;e sur la rade de Brest), les entit&eacute;s ainsi que la ChatBox et le Radar.</p>
<p><img alt="Ecran de jeu" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/demo_multi.gif"/></p>
<h3 id="le radar">Le radar</h3>
<p>Le radar est l'un des &eacute;l&eacute;ments cl&eacute;s du jeu. Il permet de d&eacute;tecter les ennemis aux alentours et de transmettre la position relative au joueur.<br/>
Le fonctionnement est relativement simple : on parcoure les entit&eacute;s pr&eacute;sente sur le serveur et on ne garde que celles qui sont &agrave; port&eacute;e par un calcul de distance euclidienne. Ensuite on v&eacute;rifie que l'entit&eacute; soit pr&eacute;sente sous le faisceau vert (voir image ci-dessous) pour &ecirc;tre affich&eacute;e &agrave; l'&eacute;cran, gr&acirc;ce &agrave; du calcul vectoriel.</p>
<p><img alt="D&eacute;monstration du Radar" class="center img-zoomable" height="300px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/radar.gif"/></p>
<h3 id="la documentation">La documentation</h3>
<p>Pour ce projet, la r&eacute;daction d'une documentation est n&eacute;cessaire. Pour nous simplifier la t&acirc;che, nous avons d&eacute;cider de tout automatiser en utilisant <a href="https://www.sphinx-doc.org">Sphinx</a>. </p>
<p>Cet outil nous permet de g&eacute;n&eacute;rer automatiquement la documentation dans le style de Read-the-Docs en prenant la documentation &eacute;crite dans les doc-strings du projet. Nous nous sommes tenu au mod&egrave;le de Google concernant les doc-strings.</p>
<p><img alt="Documentation sur ReadTheDocs" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/projets/bataille-brestoise/docs_rtd.png"/></p>
<p>Nous avons finalement upload&eacute; la documentation sur ReadTheDocs, elle est disponible &agrave; l'adresse : <a href="https://la-bataille-brestoise.readthedocs.io/fr/latest/">https://la-bataille-brestoise.readthedocs.io/fr/latest/</a></p>

                    <!-- Footer -->
                    <hr>
                    <div class="container">
                        <div class="row justify-content-sm-center">
                            <p>© 2020 Alexandre Froehlich</p>
                        </div>
                    </div>
                 </div>
            </div>
        </div>
    </div>
    <script>
      // Listen to images after DOM content is fully loaded
      document.addEventListener('DOMContentLoaded', function () {
        new Zooming({
          // options...
        }).listen('.img-zoomable')
      })
    </script>
</body>

</html>