<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom"><title>Alexandre Froehlich - eportfolio</title><link href="https://nightlyside.github.io/blog/" rel="alternate"></link><link href="https://nightlyside.github.io/blog/feeds/eportfolio.atom.xml" rel="self"></link><id>https://nightlyside.github.io/blog/</id><updated>2020-07-01T00:00:00+02:00</updated><entry><title>Comment héberger un site web (simple) avec GitHub Pages</title><link href="https://nightlyside.github.io/blog/eportfolio/comment-heberger-un-site-web-simple-avec-github-pages/" rel="alternate"></link><published>2020-07-01T00:00:00+02:00</published><updated>2020-07-01T00:00:00+02:00</updated><author><name>Alexandre Froehlich</name></author><id>tag:nightlyside.github.io,2020-07-01:/blog/eportfolio/comment-heberger-un-site-web-simple-avec-github-pages/</id><summary type="html">
&lt;p&gt;Avoir un site web à son nom est non seulement un gros plus dans le monde du numérique, mais il peut même être nécessaire pour décrocher certains emplois.
Grâce à GitHub Pages il est facile de créer un site statique et de l'héberger sur leurs serveurs, c'est ce que nous allons voir dans cet article.
&lt;/p&gt;</summary><content type="html">
&lt;p&gt;Avoir un site web &amp;agrave; son nom est non seulement un gros plus dans le monde du num&amp;eacute;rique, mais il peut m&amp;ecirc;me &amp;ecirc;tre n&amp;eacute;cessaire pour d&amp;eacute;crocher certains emplois.
Gr&amp;acirc;ce &amp;agrave; GitHub Pages il est facile de cr&amp;eacute;er un site statique et de l'h&amp;eacute;berger sur leurs serveurs, c'est ce que nous allons voir dans cet article.
&lt;/p&gt;
&lt;hr/&gt;
&lt;blockquote&gt;
&lt;p&gt;Cet article suppose que vous avez d&amp;eacute;j&amp;agrave; un compte GitHub.&lt;br/&gt;
Si ce n'est pas le cas vous pouvez lire mon article sur &lt;a href="https://nightlyside.github.io/blog/eportfolio/comment-creer-un-compte-github/"&gt;comment cr&amp;eacute;er un compte github&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id="creer le repository"&gt;Cr&amp;eacute;er le repository&lt;/h2&gt;
&lt;p&gt;La premi&amp;egrave;re &amp;eacute;tape consiste &amp;agrave; cr&amp;eacute;er le repository, le projet, qui contiendra les fichiers sur site.&lt;br/&gt;
Pour cela il suffit de cliquer sur le "plus" en haut &amp;agrave; droite et de choisir &lt;em&gt;New repository&lt;/em&gt;.  &lt;/p&gt;
&lt;p&gt;&lt;img alt="Cr&amp;eacute;er un repository" class="center img-zoomable" height="200px" src="https://nightlyside.github.io/blog/images/eportfolio/create_repo.jpg"/&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Attention&lt;/strong&gt; le choix du nom est important ! Pour pouvoir profiter de github pages, le repository doit avoir un nom de la forme : &lt;code&gt;&amp;lt;nom utilisateur&amp;gt;.github.io&lt;/code&gt;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Exemple : mon pseudo pour ces articles sur github est &lt;em&gt;skycrawler67&lt;/em&gt;, le repository doit alors se nommer &lt;code&gt;skycrawler67.github.io&lt;/code&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Il faudra bien penser &amp;agrave; mettre le repository en publique et pour nous simplifier la vie on va l'initialiser avec un README.&lt;br/&gt;
Enfin, cliquez sur le bouton &lt;em&gt;Create Repository&lt;/em&gt; pour cr&amp;eacute;er le repository.&lt;/p&gt;
&lt;p&gt;&lt;img alt="Page de cr&amp;eacute;ation repository" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/eportfolio/create_repo_page.jpg"/&gt;&lt;/p&gt;
&lt;h2 id="activer l'hebergement par github pages"&gt;Activer l'h&amp;eacute;bergement par GitHub Pages&lt;/h2&gt;
&lt;p&gt;Une fois les &amp;eacute;tapes pr&amp;eacute;c&amp;eacute;dentes r&amp;eacute;alis&amp;eacute;es vous devriez arriver sur la page principale de votre repository, vous montrant le contenu du fichier README ainsi que les fichiers pr&amp;eacute;sents dans ce projet.&lt;/p&gt;
&lt;p&gt;Pour activer l'h&amp;eacute;bergement sur GitHub Pages il faut aller dans les param&amp;egrave;tres (cliquez sur l'engrenage) puis descendez jusqu'&amp;agrave; la section "GitHub Pages". Si toutes les &amp;eacute;tapes pr&amp;eacute;c&amp;eacute;dentes ont &amp;eacute;t&amp;eacute; suivies, le site nous explique que le site est bien publi&amp;eacute; &amp;agrave; l'adresse correspondant au nom du repository.  &lt;/p&gt;
&lt;p&gt;Si ce n'est pas le cas il vous faudra sp&amp;eacute;cifier la branche que github devra suivre pour la publication. La branch &lt;em&gt;master&lt;/em&gt; est la plus commun&amp;eacute;ment utilis&amp;eacute;e, il s'agit de la branche principale.&lt;/p&gt;
&lt;p&gt;&lt;img alt="Section GitHub Pages" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/eportfolio/github_pages_section.jpg"/&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Exemple : en suivant ce que j'ai &amp;eacute;crit, mon site est alors publi&amp;eacute; sur &lt;a href="https://skycrawler67.github.io/"&gt;https://skycrawler67.github.io/&lt;/a&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id="conclusion"&gt;Conclusion&lt;/h2&gt;
&lt;p&gt;Pour v&amp;eacute;rifier que le site est bien en ligne il suffit de suivre le lien. Si tout s'est bien pass&amp;eacute; le lien affiche le contenu du fichier &lt;em&gt;README.md&lt;/em&gt;. Il ne reste alors plus qu'&amp;agrave; cr&amp;eacute;er le site et l'envoyer sur ce repository pour qu'il soit publi&amp;eacute; sur la page. &lt;/p&gt;
&lt;p&gt;Pour aller plus loin :&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Cr&amp;eacute;er un site web statique avec Jekyll/Hugo/Pelican (recommand&amp;eacute;)&lt;/li&gt;
&lt;li&gt;Cr&amp;eacute;er une landing page (page d'accueil) en HTML/CSS/JS avec par exemple &lt;a href="https://getbootstrap.com/"&gt;Bootstrap&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;R&amp;eacute;diger des articles, des postes, mettre son CV en ligne etc...&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;Ce site &amp;agrave; &amp;eacute;t&amp;eacute; con&amp;ccedil;ut avec Pelican et upload&amp;eacute; sur GitHub Pages, je vous expliquerai dans un prochain article comment reproduire ce que j'ai fait&lt;/p&gt;
&lt;/blockquote&gt;</content><category term="eportfolio"></category><category term="web"></category><category term="github"></category><category term="portfolio"></category></entry><entry><title>Comment créer un compte GitHub</title><link href="https://nightlyside.github.io/blog/eportfolio/comment-creer-un-compte-github/" rel="alternate"></link><published>2020-06-29T00:00:00+02:00</published><updated>2020-06-29T00:00:00+02:00</updated><author><name>Alexandre Froehlich</name></author><id>tag:nightlyside.github.io,2020-06-29:/blog/eportfolio/comment-creer-un-compte-github/</id><summary type="html">
&lt;p&gt;&lt;a href="https://github.com/"&gt;GitHub&lt;/a&gt; est devenu très rapidement la référence en logiciel de gestion de développement. Aujourd'hui les projets open-source sont très nombreux sur la plateforme et de plus en plus d'entreprises demande aux candidats de leur fournir en plus de leur CV, leur compte github afin de voir les projets du candidat ainsi que ses contributions au monde open-source.
&lt;/p&gt;</summary><content type="html">
&lt;p&gt;&lt;a href="https://github.com/"&gt;GitHub&lt;/a&gt; est devenu tr&amp;egrave;s rapidement la r&amp;eacute;f&amp;eacute;rence en logiciel de gestion de d&amp;eacute;veloppement. Aujourd'hui les projets open-source sont tr&amp;egrave;s nombreux sur la plateforme et de plus en plus d'entreprises demande aux candidats de leur fournir en plus de leur CV, leur compte github afin de voir les projets du candidat ainsi que ses contributions au monde open-source.
&lt;/p&gt;
&lt;hr/&gt;
&lt;h2 id="creer un compte sur github"&gt;Cr&amp;eacute;er un compte sur github&lt;/h2&gt;
&lt;p&gt;Tout d'abord, il faut savoir que GitHub est gratuit. La fonctionnalit&amp;eacute; "Pro" ajoute certes quelques &amp;eacute;l&amp;eacute;ments int&amp;eacute;ressants mais qui ne sont pas utiles au jeune d&amp;eacute;veloppeur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Si vous &amp;ecirc;tes &amp;eacute;tudiant vous pouvez obtenir un compte pro en passant par &lt;a href="https://education.github.com/"&gt;le pack &amp;eacute;ducation&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Pour cr&amp;eacute;er un compte il suffit d'aller sur le site &lt;a href="https://github.com/"&gt;https://github.com/&lt;/a&gt; et de renseigner les champs suivants.&lt;/p&gt;
&lt;p&gt;&lt;img alt="Page inscription github" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/eportfolio/inscription_github_1.jpg"/&gt;&lt;/p&gt;
&lt;h2 id="valider le compte"&gt;Valider le compte&lt;/h2&gt;
&lt;p&gt;Comme la plateforme est s&amp;eacute;rieuse et que le contenu publi&amp;eacute; est important pour les d&amp;eacute;veloppeurs, il est n&amp;eacute;cessaire d'activer son compte avant de pouvoir continuer.&lt;br/&gt;
Il s'agit donc de r&amp;eacute;soudre un petit puzzle pour valider le compte (surtout que vous n'&amp;ecirc;tes pas un robot).&lt;/p&gt;
&lt;p&gt;&lt;img alt="Page inscription github" class="center img-zoomable" height="400px" src="https://nightlyside.github.io/blog/images/eportfolio/inscription_github_2.jpg"/&gt;
Enfin, cliquez sur &lt;em&gt;join a free plan&lt;/em&gt;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;N'oubliez pas de regarder vos mails pour activer votre compte.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id="quelques infos sur votre profil"&gt;Quelques infos sur votre profil&lt;/h2&gt;
&lt;p&gt;Pour pouvoir remplir un profil de base, l'&amp;eacute;tape suivante est de donner quelques d&amp;eacute;tails sur votre formation de programmeur.&lt;br/&gt;
Entre autres : le type de travail, l'exp&amp;eacute;rience en programmation et l'utilisation pr&amp;eacute;vue de GitHub.  &lt;/p&gt;
&lt;p&gt;Personnellement &amp;eacute;tant un &amp;eacute;tudiant avec de l'&amp;eacute;xp&amp;eacute;rience en programmation je coche : &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Student : I go to school&lt;/li&gt;
&lt;li&gt;A lot : I'm very experienced&lt;/li&gt;
&lt;li&gt;Host a project (repository), Create a website with GitHub Pages, School work and student projects&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Enfin dans mes int&amp;eacute;r&amp;ecirc;ts j'indique comme langage (pour ma part) python, html, php, javascript.  &lt;/p&gt;
&lt;p&gt;Cliquez sur &lt;em&gt;Complete Setup&lt;/em&gt;.&lt;/p&gt;
&lt;h2 id="les prochaines etapes"&gt;Les prochaines &amp;eacute;tapes&lt;/h2&gt;
&lt;p&gt;Maintenant que vous avez un compte github, voici quelques &amp;eacute;tapes que vous pouvez faire : &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Cr&amp;eacute;er un repository et commencer un projet&lt;/li&gt;
&lt;li&gt;Collaborer sur un projet en commun&lt;/li&gt;
&lt;li&gt;Changer votre nom et votre avatar&lt;/li&gt;
&lt;li&gt;&lt;a href="https://nightlyside.github.io/blog/eportfolio/comment-heberger-un-site-web-simple-avec-github-pages/"&gt;H&amp;eacute;berger un site web avec GitHub Pages&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</content><category term="eportfolio"></category><category term="web"></category><category term="github"></category><category term="portfolio"></category></entry></feed>